logs/fio-diskseq/Strato 4v 8GB/000/log006.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;521517;2037;32170;0;0;0.000000;0.000000;67;197589;482.267488;2265.659885;1.000000%=70;5.000000%=71;10.000000%=72;20.000000%=74;30.000000%=76;40.000000%=81;50.000000%=85;60.000000%=90;70.000000%=101;80.000000%=113;90.000000%=132;95.000000%=160;99.000000%=13434;99.500000%=14221;99.900000%=14614;99.950000%=14614;99.990000%=15007;0%=0;0%=0;0%=0;69;197592;484.351893;2265.640060;368640;1992192;100.000000%;522008.000000;195040.650566;0.323293%;20.609904%;2344;0;14;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;69.04%;27.29%;0.18%;0.01%;0.01%;0.01%;0.00%;1.77%;1.70%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;13093;0;27;0;1480573;1480576;97.72%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3432: Mon Jan  8 14:05:58 2024
  write: IOPS=2037, BW=509MiB/s (534MB/s)(16.0GiB/32170msec); 0 zone resets
    clat (usec): min=67, max=197589, avg=482.27, stdev=2265.66
     lat (usec): min=69, max=197592, avg=484.35, stdev=2265.64
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   72], 10.00th=[   73], 20.00th=[   75],
     | 30.00th=[   77], 40.00th=[   82], 50.00th=[   86], 60.00th=[   91],
     | 70.00th=[  102], 80.00th=[  114], 90.00th=[  133], 95.00th=[  161],
     | 99.00th=[13435], 99.50th=[14222], 99.90th=[14615], 99.95th=[14615],
     | 99.99th=[15008]
   bw (  KiB/s): min=368640, max=1992192, per=100.00%, avg=522008.00, stdev=195040.65, samples=64
   iops        : min= 1440, max= 7782, avg=2039.12, stdev=761.87, samples=64
  lat (usec)   : 100=69.04%, 250=27.29%, 500=0.18%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=1.77%, 20=1.70%, 50=0.01%, 250=0.01%
  cpu          : usr=0.32%, sys=20.61%, ctx=2344, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=509MiB/s (534MB/s), 509MiB/s-509MiB/s (534MB/s-534MB/s), io=16.0GiB (17.2GB), run=32170-32170msec

Disk stats (read/write):
  vda: ios=0/13093, merge=0/27, ticks=0/1480573, in_queue=1480576, util=97.72%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;484932;1894;34597;0;0;0.000000;0.000000;57;2919;521.641089;77.175514;1.000000%=284;5.000000%=436;10.000000%=456;20.000000%=485;30.000000%=505;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=561;90.000000%=585;95.000000%=602;99.000000%=684;99.500000%=749;99.900000%=1220;99.950000%=1482;99.990000%=2211;0%=0;0%=0;0%=0;57;2919;521.759748;77.156530;258048;489472;100.000000%;485242.434783;27754.552281;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.303503%;16.845878%;65310;0;76;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.32%;0.58%;26.88%;71.73%;0.28%;0.21%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65139;1084;0;2;62711;67729;130441;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3435: Mon Jan  8 14:06:33 2024
  read: IOPS=1894, BW=474MiB/s (497MB/s)(16.0GiB/34597msec)
    clat (usec): min=57, max=2919, avg=521.64, stdev=77.18
     lat (usec): min=57, max=2919, avg=521.76, stdev=77.16
    clat percentiles (usec):
     |  1.00th=[  285],  5.00th=[  437], 10.00th=[  457], 20.00th=[  486],
     | 30.00th=[  506], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  562], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  685], 99.50th=[  750], 99.90th=[ 1221], 99.95th=[ 1483],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=258048, max=489472, per=100.00%, avg=485242.43, stdev=27754.55, samples=69
   iops        : min= 1008, max= 1912, avg=1895.48, stdev=108.42, samples=69
  lat (usec)   : 100=0.32%, 250=0.58%, 500=26.88%, 750=71.73%, 1000=0.28%
  lat (msec)   : 2=0.21%, 4=0.01%
  cpu          : usr=0.30%, sys=16.85%, ctx=65310, majf=0, minf=76
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=16.0GiB (17.2GB), run=34597-34597msec

Disk stats (read/write):
  vda: ios=65139/1084, merge=0/2, ticks=62711/67729, in_queue=130441, util=100.00%