logs/fio-diskseq/Strato 4v 8GB/000/log007.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;523013;2043;32078;0;0;0.000000;0.000000;66;200908;482.113747;2366.258887;1.000000%=69;5.000000%=71;10.000000%=72;20.000000%=74;30.000000%=76;40.000000%=81;50.000000%=86;60.000000%=92;70.000000%=107;80.000000%=117;90.000000%=136;95.000000%=173;99.000000%=13434;99.500000%=14221;99.900000%=14614;99.950000%=14614;99.990000%=17694;0%=0;0%=0;0%=0;68;200914;484.105552;2366.243754;346624;1581056;100.000000%;523448.968750;175444.889355;0.498800%;20.603548%;2253;0;16;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;66.28%;30.20%;0.10%;0.01%;0.00%;0.01%;0.01%;1.67%;1.73%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;13090;0;25;0;1469875;1469877;97.90%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3450: Mon Jan  8 14:07:15 2024
  write: IOPS=2043, BW=511MiB/s (536MB/s)(16.0GiB/32078msec); 0 zone resets
    clat (usec): min=66, max=200908, avg=482.11, stdev=2366.26
     lat (usec): min=68, max=200914, avg=484.11, stdev=2366.24
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[   72], 10.00th=[   73], 20.00th=[   75],
     | 30.00th=[   77], 40.00th=[   82], 50.00th=[   87], 60.00th=[   93],
     | 70.00th=[  108], 80.00th=[  118], 90.00th=[  137], 95.00th=[  174],
     | 99.00th=[13435], 99.50th=[14222], 99.90th=[14615], 99.95th=[14615],
     | 99.99th=[17695]
   bw (  KiB/s): min=346624, max=1581056, per=100.00%, avg=523448.97, stdev=175444.89, samples=64
   iops        : min= 1354, max= 6176, avg=2044.72, stdev=685.33, samples=64
  lat (usec)   : 100=66.28%, 250=30.20%, 500=0.10%, 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.67%, 20=1.73%, 50=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=0.50%, sys=20.60%, ctx=2253, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=511MiB/s (536MB/s), 511MiB/s-511MiB/s (536MB/s-536MB/s), io=16.0GiB (17.2GB), run=32078-32078msec

Disk stats (read/write):
  vda: ios=0/13090, merge=0/25, ticks=0/1469875, in_queue=1469877, util=97.90%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;485128;1895;34583;0;0;0.000000;0.000000;59;4196;521.519149;80.601877;1.000000%=280;5.000000%=436;10.000000%=456;20.000000%=485;30.000000%=501;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=561;90.000000%=585;95.000000%=602;99.000000%=684;99.500000%=749;99.900000%=1318;99.950000%=1662;99.990000%=2277;0%=0;0%=0;0%=0;59;4196;521.653570;80.594973;271872;488960;100.000000%;485450.202899;26090.920265;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.349893%;17.309583%;65328;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.34%;0.56%;26.98%;71.64%;0.27%;0.19%;0.02%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65167;1063;0;3;62658;62343;125000;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3454: Mon Jan  8 14:07:50 2024
  read: IOPS=1895, BW=474MiB/s (497MB/s)(16.0GiB/34583msec)
    clat (usec): min=59, max=4196, avg=521.52, stdev=80.60
     lat (usec): min=59, max=4196, avg=521.65, stdev=80.59
    clat percentiles (usec):
     |  1.00th=[  281],  5.00th=[  437], 10.00th=[  457], 20.00th=[  486],
     | 30.00th=[  502], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  562], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  685], 99.50th=[  750], 99.90th=[ 1319], 99.95th=[ 1663],
     | 99.99th=[ 2278]
   bw (  KiB/s): min=271872, max=488960, per=100.00%, avg=485450.20, stdev=26090.92, samples=69
   iops        : min= 1062, max= 1910, avg=1896.29, stdev=101.92, samples=69
  lat (usec)   : 100=0.34%, 250=0.56%, 500=26.98%, 750=71.64%, 1000=0.27%
  lat (msec)   : 2=0.19%, 4=0.02%, 10=0.01%
  cpu          : usr=0.35%, sys=17.31%, ctx=65328, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=16.0GiB (17.2GB), run=34583-34583msec

Disk stats (read/write):
  vda: ios=65167/1063, merge=0/3, ticks=62658/62343, in_queue=125000, util=100.00%